app/controllers/api/v1/climas_controller.rb

    def index
      @climas = Clima.order("created_at DESC")
---
SELECT "climas".* FROM "climas" ORDER BY created_at DESC

    def create
     @clima = Clima.create(clima_params)
---
INSERT INTO "climas" ("ciudad", "estado", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ciudad", ""], ["estado", ""], ["created_at", "2018-04-06 01:31:56.219781"], ["updated_at", "2018-04-06 01:31:56.219781"]]

   def update
      @clima = Clima.find(params[:id])
      @clima.update_attributes(clima_params)
---
SELECT  "climas".* FROM "climas" WHERE "climas"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "climas" SET "estado" = ?, "updated_at" = ? WHERE "climas"."id" = ?  [["estado", "Lluvioso"], ["updated_at", "2018-04-06 02:14:31.659931"], ["id", 11]]